source/red-green-refactor.md
```mermaid
graph TD;
 data_path(["data input:\ntests/data/Ramsar__England__.zip"])
 metadata_path [label="metadata input:
tests/data/Ramsar__England__.xml" shape=oval]
 "VectorLayer.from_files" [label="function:
VectorLayer.from_files" shape=box]
 VectorLayer [label="output:
VectorLayer" shape=parallelogram]
 data_path -> "VectorLayer.from_files"
 metadata_path -> "VectorLayer.from_files"
 "VectorLayer.from_files" -> VectorLayer
 "VectorLayer.to_tiles" [label="function:
VectorLayer.to_tiles" shape=box]
 TiledVectorLayer [label="output:
TiledVectorLayer" shape=parallelogram]
 VectorLayer -> "VectorLayer.to_tiles"
 "VectorLayer.to_tiles" -> TiledVectorLayer
 "TiledVectorLayer.to_data_array_as_mask" [label="function:
TiledVectorLayer.to_data_array_as_mask" shape=box]
 "xarray.DataArray" [label="output:
xarray.DataArray" shape=parallelogram]
 TiledVectorLayer -> "TiledVectorLayer.to_data_array_as_mask"
 "TiledVectorLayer.to_data_array_as_mask" -> "xarray.DataArray"

```
